app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100
---
  def index
    @urls = ShortUrl.order(click_count: :desc).limit(100)

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://canva.com', '2022-04-29 00:31:26.941152', '2022-04-29 00:31:26.941152')
---
  def create
    full_url = params[:full_url]
    @short_url = ShortUrl.new(full_url: full_url)
    if @short_url.save

UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-05-02 06:51:15.661677' WHERE `short_urls`.`id` = 22
---
  def show
    begin
      @short_url = ShortUrl.find_by_short_code(params[:id])
      @short_url.update(click_count: @short_url.click_count + 1)