app/jobs/update_title_job.rb

  def perform(short_url_id)
    ShortUrl.find(short_url_id).update_title!
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 13 LIMIT 1